; domain
(define (domain Perestroika)
(:requirements :typing :equality)
(:types location resource - object
        
)

(:predicates (at-agent ?l - location)
             (connected ?l1 ?l2 - location)
             (at-res ?r - resource ?l - location)
             (taken ?r - resource)
             (accessible ?l - location)
             (alive)
             (dead)
             (solid ?l - location)
             (big ?l - location)
             (medium ?l - location)
             (small ?l - location)
             (none ?l - location)   
             (act-round)

            ; (dup-accessible ?l - location)
)

(:action move
:parameters (?l1 ?l2 - location)
:precondition (and (at-agent ?l1)
                   (alive)
                   (connected ?l1 ?l2)
                   (accessible ?l2)
                  ; (dup-accessible ?l2)
              )
:effect (and (not (at-agent ?l1))
             (at-agent ?l2)
        )
)

(:action collect
:parameters (?r - resource ?l - location)
:precondition (and (at-agent ?l)
                   (at-res ?r ?l)
                   (alive)
              )
:effect (and (taken ?r)
        )
)


)

; problem
(define (problem Perestroika-problem)
(:domain Perestroika)
(:objects r1 r2 r3 r4 r5 r6 r7 r8 - resource
          l-1-1 l-1-2 l-1-3 l-1-4 l-1-5 l-2-1 l-2-2 l-2-3 l-2-4 l-2-5 l-3-1 l-3-2 l-3-3 l-3-4 l-3-5 l-4-1 l-4-2 l-4-3 l-4-4 l-4-5 l-5-1 l-5-2 l-5-3 l-5-4 l-5-5 - location
)

(:init (act-round)
       (alive)
       (at-agent l-1-1)
       (at-res r1 l-1-5)
       (at-res r2 l-3-3)
       (at-res r3 l-5-5)
       (at-res r4 l-5-1)
       (at-res r5 l-5-3)
       (at-res r6 l-1-3)
       (at-res r7 l-3-5)
       (at-res r8 l-3-1)

       (connected l-1-1 l-2-1)
(connected l-2-1 l-1-1)
(connected l-1-1 l-1-2)
(connected l-1-2 l-1-1)
(connected l-1-2 l-2-2)
(connected l-2-2 l-1-2)
(connected l-1-2 l-1-3)
(connected l-1-3 l-1-2)
(connected l-1-3 l-2-3)
(connected l-2-3 l-1-3)
(connected l-1-3 l-1-4)
(connected l-1-4 l-1-3)
(connected l-1-4 l-2-4)
(connected l-2-4 l-1-4)
(connected l-1-4 l-1-5)
(connected l-1-5 l-1-4)
(connected l-1-5 l-2-5)
(connected l-2-5 l-1-5)
(connected l-2-1 l-3-1)
(connected l-3-1 l-2-1)
(connected l-2-1 l-2-2)
(connected l-2-2 l-2-1)
(connected l-2-2 l-3-2)
(connected l-3-2 l-2-2)
(connected l-2-2 l-2-3)
(connected l-2-3 l-2-2)
(connected l-2-3 l-3-3)
(connected l-3-3 l-2-3)
(connected l-2-3 l-2-4)
(connected l-2-4 l-2-3)
(connected l-2-4 l-3-4)
(connected l-3-4 l-2-4)
(connected l-2-4 l-2-5)
(connected l-2-5 l-2-4)
(connected l-2-5 l-3-5)
(connected l-3-5 l-2-5)
(connected l-3-1 l-4-1)
(connected l-4-1 l-3-1)
(connected l-3-1 l-3-2)
(connected l-3-2 l-3-1)
(connected l-3-2 l-4-2)
(connected l-4-2 l-3-2)
(connected l-3-2 l-3-3)
(connected l-3-3 l-3-2)
(connected l-3-3 l-4-3)
(connected l-4-3 l-3-3)
(connected l-3-3 l-3-4)
(connected l-3-4 l-3-3)
(connected l-3-4 l-4-4)
(connected l-4-4 l-3-4)
(connected l-3-4 l-3-5)
(connected l-3-5 l-3-4)
(connected l-3-5 l-4-5)
(connected l-4-5 l-3-5)
(connected l-4-1 l-5-1)
(connected l-5-1 l-4-1)
(connected l-4-1 l-4-2)
(connected l-4-2 l-4-1)
(connected l-4-2 l-5-2)
(connected l-5-2 l-4-2)
(connected l-4-2 l-4-3)
(connected l-4-3 l-4-2)
(connected l-4-3 l-5-3)
(connected l-5-3 l-4-3)
(connected l-4-3 l-4-4)
(connected l-4-4 l-4-3)
(connected l-4-4 l-5-4)
(connected l-5-4 l-4-4)
(connected l-4-4 l-4-5)
(connected l-4-5 l-4-4)
(connected l-4-5 l-5-5)
(connected l-5-5 l-4-5)
(connected l-5-1 l-5-2)
(connected l-5-2 l-5-1)
(connected l-5-2 l-5-3)
(connected l-5-3 l-5-2)
(connected l-5-3 l-5-4)
(connected l-5-4 l-5-3)
(connected l-5-4 l-5-5)
(connected l-5-5 l-5-4)

(accessible l-1-1)
(solid l-1-1)
(accessible l-1-2)
(medium l-1-2)
(accessible l-1-3)
(solid l-1-3)
(accessible l-1-4)
(small l-1-4)
(accessible l-1-5)
(solid l-1-5)
(accessible l-2-1)
(big l-2-1)
(accessible l-2-2)
(small l-2-2)
(accessible l-2-3)
(small l-2-3)
(accessible l-2-4)
(medium l-2-4)
(accessible l-2-5)
(medium l-2-5)
(accessible l-3-1)
(solid l-3-1)
(accessible l-3-2)
(small l-3-2)
(accessible l-3-3)
(solid l-3-3)
(accessible l-3-4)
(big l-3-4)
(accessible l-3-5)
(solid l-3-5)
(accessible l-4-1)
(small l-4-1)
(accessible l-4-2)
(big l-4-2)
(accessible l-4-3)
(big l-4-3)
(accessible l-4-4)
(medium l-4-4)
(accessible l-4-5)
(small l-4-5)
(accessible l-5-1)
(solid l-5-1)
(accessible l-5-2)
(medium l-5-2)
(accessible l-5-3)
(solid l-5-3)
(accessible l-5-4)
(small l-5-4)
(accessible l-5-5)
(solid l-5-5)

)

(:goal (and (alive)
            (taken r1)
            (taken r2)
            (taken r3)
            (taken r4)
            (taken r5)
            (taken r6)
            (taken r7)
            (taken r8)
       )
)
)

; plan
1. (move l-1-1 l-1-2)
   deleted: (at-agent l-1-1)
   added: (at-agent l-1-2)
   goals met: 1 of 9
2. (move l-1-2 l-1-3)
   deleted: (at-agent l-1-2)
   added: (at-agent l-1-3)
   goals met: 1 of 9
3. (collect r6 l-1-3)
   added: (taken r6)
   goals met: 2 of 9
4. (move l-1-3 l-1-4)
   deleted: (at-agent l-1-3)
   added: (at-agent l-1-4)
   goals met: 2 of 9
5. (move l-1-4 l-1-5)
   deleted: (at-agent l-1-4)
   added: (at-agent l-1-5)
   goals met: 2 of 9
6. (collect r1 l-1-5)
   added: (taken r1)
   goals met: 3 of 9
7. (move l-1-5 l-2-5)
   deleted: (at-agent l-1-5)
   added: (at-agent l-2-5)
   goals met: 3 of 9
8. (move l-2-5 l-3-5)
   deleted: (at-agent l-2-5)
   added: (at-agent l-3-5)
   goals met: 3 of 9
9. (collect r7 l-3-5)
   added: (taken r7)
   goals met: 4 of 9
10. (move l-3-5 l-3-4)
   deleted: (at-agent l-3-5)
   added: (at-agent l-3-4)
   goals met: 4 of 9
11. (move l-3-4 l-3-3)
   deleted: (at-agent l-3-4)
   added: (at-agent l-3-3)
   goals met: 4 of 9
12. (collect r2 l-3-3)
   added: (taken r2)
   goals met: 5 of 9
13. (move l-3-3 l-3-2)
   deleted: (at-agent l-3-3)
   added: (at-agent l-3-2)
   goals met: 5 of 9
14. (move l-3-2 l-3-1)
   deleted: (at-agent l-3-2)
   added: (at-agent l-3-1)
   goals met: 5 of 9
15. (collect r8 l-3-1)
   added: (taken r8)
   goals met: 6 of 9
16. (move l-3-1 l-4-1)
   deleted: (at-agent l-3-1)
   added: (at-agent l-4-1)
   goals met: 6 of 9
17. (move l-4-1 l-5-1)
   deleted: (at-agent l-4-1)
   added: (at-agent l-5-1)
   goals met: 6 of 9
18. (collect r4 l-5-1)
   added: (taken r4)
   goals met: 7 of 9
19. (move l-5-1 l-5-2)
   deleted: (at-agent l-5-1)
   added: (at-agent l-5-2)
   goals met: 7 of 9
20. (move l-5-2 l-5-3)
   deleted: (at-agent l-5-2)
   added: (at-agent l-5-3)
   goals met: 7 of 9
21. (collect r5 l-5-3)
   added: (taken r5)
   goals met: 8 of 9
22. (move l-5-3 l-5-4)
   deleted: (at-agent l-5-3)
   added: (at-agent l-5-4)
   goals met: 8 of 9
23. (move l-5-4 l-5-5)
   deleted: (at-agent l-5-4)
   added: (at-agent l-5-5)
   goals met: 8 of 9
24. (collect r3 l-5-5)
   added: (taken r3)
   goals met: 9 of 9
